src/Documents/bz_ВыставлениеРабот/bz_ВыставлениеРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>bz_ВыставлениеРабот</name>
  <registerRecords>AccumulationRegister.bz_СписанныеТрудозатраты</registerRecords>
  <registerRecords>AccumulationRegister.bz_РаботыКВыставлению</registerRecords>
  <registerRecords>AccumulationRegister.bz_Выработка</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.bz_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыработкаПрошлыхПериодов</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.bz_ЭтапыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.bz_Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтработано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОтработано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВыставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСписано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВыставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервичныйДокумент</name>
      <type>
        <types>DocumentRef.bz_ВыставлениеРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиПервичногоДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выработка</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.bz_ЭтапыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.bz_Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСодержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПримечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВыставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСписано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененаВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПВР</name>
      <type>
        <types>CatalogRef.bz_ПозицияВыполненияРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеВыработки</name>
    <attributes>
      <name>КлючСтрокиВыработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.bz_ВариантыВыставленияОтработанногоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.bz_ПричиныСписанияТрудозатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/bz_СостоянияЗакрытияПериодов/bz_СостоянияЗакрытияПериодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>bz_СостоянияЗакрытияПериодов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.bz_СостоянияПроектовВПериодах</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДействияПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.bz_Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/bz_Выработка/bz_Выработка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>bz_Выработка</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Трудозатраты</name>
    <comment>Трудозатраты (в часах дробно)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудозатратыМинуты</name>
    <comment>Трудозатраты (в минутах)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыставлено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудозатратыВыставлено</name>
    <comment>Трудозатраты (в часах дробно)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудозатратыДляСогласования</name>
    <comment>Трудозатраты (в часах дробно)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДляСогласования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПВР</name>
    <type>
      <types>CatalogRef.bz_ПозицияВыполненияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыЧД</name>
    <comment>Трудозатраты (часы, как в документе)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыМД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.bz_Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.bz_ЭтапыПроектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.bz_Работы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/bz_ПочасовыеСтавкиРабот/bz_ПочасовыеСтавкиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>bz_ПочасовыеСтавкиРабот</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.bz_Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.bz_Работы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="82f7cfff-d9c7-47a5-91c8-dcdc976b1ae4">
  <name>Периодичность</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="35a97566-09b7-432f-85ff-4d56244ade1f">
    <name>Месяц</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Documents/bz_ВыставлениеРабот/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьСервер();
КонецПроцедуры     

&НаСервере
Процедура ЗаполнитьСервер()
	СостоянияЗакрытия = ПолучитьСостоянияЗакрытия();
	Объект.ВыработкаПрошлыхПериодов.Очистить();
	Объект.Выработка.Очистить();
	ЗаполнитьОстатки();
	ЗаполнитьТекМесяц();
КонецПроцедуры



&НаСервере
Функция ПолучитьСостоянияЗакрытия()
	Результат=РегистрыСведений.bz_СостоянияЗакрытияПериодов.ПолучитьПоследнее(Объект.Дата, Новый Структура("Проект", Объект.Проект));
	//Запрос=Новый Запрос;
	//Запрос.Текст=
	//"ВЫБРАТЬ
	//|	Т.Проект КАК Проект,
	//|	Т.Периодичность КАК Периодичность,
	//|	Т.Состояние КАК Состояние,
	//|	Т.ДатаДействияПо КАК ДатаДействияПо,
	//|	Т.Период КАК Период
	//|ИЗ
	//|	РегистрСведений.bz_СостоянияЗакрытияПериодов.СрезПоследних(&Дата, Проект = &Проект) КАК Т";
	//Запрос.УстановитьПараметр("Дата",);
	//Запрос.УстановитьПараметр("Периодичность",);
	//Результат=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	Возврат Результат;
КонецФункции


&НаСервере
Процедура ЗаполнитьТекМесяц()
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	bz_Выработка.Этап КАК Этап,
	|	bz_Выработка.Работа КАК Работа,
	|	bz_Выработка.Сотрудник КАК Сотрудник,
	|	bz_Выработка.Работа.НеВыставляется КАК НеВыставляется,
	|	bz_Выработка.Трудозатраты КАК КоличествоОтработано,
	|	bz_Выработка.Содержание КАК Содержание,
	|	bz_Выработка.Примечание КАК Примечание,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(bz_Выработка.Работа.НеВыставляется, ЛОЖЬ) = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ bz_Выработка.Трудозатраты
	|	КОНЕЦ КАК КоличествоВыставлено,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(bz_Выработка.Работа.НеВыставляется, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА 0
	|		ИНАЧЕ bz_Выработка.Трудозатраты
	|	КОНЕЦ КАК КоличествоСписано,
	|	bz_Выработка.Проект.КонтрагентРаботодатель КАК КонтрагентРаботодатель,
	|	bz_Выработка.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.bz_Выработка КАК bz_Выработка
	|ГДЕ
	|	bz_Выработка.Период МЕЖДУ &Дата1 И &Дата2
	|	И bz_Выработка.Активность = ИСТИНА
	|	И bz_Выработка.Организация = &Организация
	|	И bz_Выработка.Проект = &Проект";
	
	Запрос.УстановитьПараметр("Дата1", Перечисления.Периодичность.НачалоПериода(Объект.Дата, Объект.Периодичность, Перечисления.Периодичность.Месяц));
	Запрос.УстановитьПараметр("Дата2", Перечисления.Периодичность.КонецПериода(Объект.Дата, Объект.Периодичность, Перечисления.Периодичность.Месяц));
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока Выборка.Следующий() Цикл
		НовСтр = Объект.Выработка.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		Ставка = РегистрыСведений.bz_ПочасовыеСтавкиРабот.ПолучитьСтавку(Объект.Дата, Объект.Проект, Выборка.Работа, Выборка.КонтрагентРаботодатель);
		НовСтр.Сумма  = Ставка * Выборка.КоличествоОтработано;
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьОстатки()
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	bz_ВыставленныеРаботыОстатки.Этап КАК Этап,
	|	bz_ВыставленныеРаботыОстатки.Работа КАК Работа,
	|	bz_ВыставленныеРаботыОстатки.Сотрудник КАК Сотрудник,
	|	bz_ВыставленныеРаботыОстатки.КоличествоОтработаноОстаток КАК КоличествоОтработано,
	|	bz_ВыставленныеРаботыОстатки.СуммаОтработаноОстаток КАК Сумма,
	|	ПредыдущаяВыработкаТЧ.Содержание КАК Содержание,
	|	ПредыдущаяВыработкаТЧ.Примечание КАК Примечание
	|ИЗ
	|	РегистрНакопления.bz_ВыставленныеРаботы.Остатки(
	|			&Дата,
	|			Организация = &Организация
	|				И Проект = &Проект) КАК bz_ВыставленныеРаботыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.bz_ВыставлениеРабот.Выработка КАК ПредыдущаяВыработкаТЧ
	|		ПО bz_ВыставленныеРаботыОстатки.Документ = ПредыдущаяВыработкаТЧ.Ссылка
	|			И bz_ВыставленныеРаботыОстатки.НомерСтр = ПредыдущаяВыработкаТЧ.НомерСтроки
	|ГДЕ
	|	(bz_ВыставленныеРаботыОстатки.КоличествоОтработаноОстаток <> 0
	|			ИЛИ bz_ВыставленныеРаботыОстатки.СуммаОтработаноОстаток <> 0)";
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока Выборка.Следующий() Цикл    
		НовСтр = Объект.ВыработкаПрошлыхПериодов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяВыработкаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтр = Элементы.Выработка.ТекущиеДанные;
	Если НоваяСтрока или Копирование Тогда
		ТекСтр.ИзмененаВручную = Истина;
	КонецЕсли;  
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяВыработкаПриИзмененииРеквизитоыИзВыполненияРабот(Элемент)
	ТекСтр = Элементы.Выработка.ТекущиеДанные;
	ТекСтр.ИзмененаВручную = Истина;
КонецПроцедуры
